# Primitive Data Type
# Number , Boolean , String 

# Non-Primitive Data Type / Collection / Data structure ข้อมูลชนิดไม่พื้นฐาน
# List , Tuple , Set , Dicrionary

# Data Type จะเอามาใช้กับการเขียนโปรแกรมในเรื่องของ ตัวแปร พารามิเตอร์ ฟังก์ชั่น เมธอด

#------- List คือ ข้อมูลหลายข้อมูล คนละชนิด ซ้ำกันได้ และมีลำดับ อีกทั้งแก้ไขได้ด้วย ----------
        #   0   1   2   3   4       5
my_list1 = [10,20, True, 10, 'SAU', [20, 'IOT']]
            #   6   5   4   3   2       1   ติด -

# ------ Tuple คือ ข้อมูลหลายข้อมูล คนละชนิด ซ้ำกันได้ และมีลำดับ แต่แก้ไขไม่ได้ เพิ่ม ลบก็ไม่ได้ ------
        #   0   1   2   3   4       5
my_tuple1 = (10, 20, True, 10, 'SAU', (20, 'IOT'))
            #   6   5   4   3   2       1   ติด -

# ------- Set คือ ข้อมูลหลายข้อมูล คนละชนิด ซ้ำกันไม่ได้ (ถ้าซ้ำถือว่าเป็นตัวเดียว) และไม่มีลำดับ และแก้ไขไม่ได้ แต่เพิ่ม ลบได้ --------
my_set1 = {10, 20, True,10, 'SAU', (20, 'IOT')}

# ******* Dictionary คือ ข้อมูลหลายข้อมูล ที่เป็น key:value แก้ไขได้ด้วย ไม่มีลำดับ ซ้ำได้ ----------
# key เป็น String/Integer ส่วน value เป็นอิหยังก็ได้ (number,string,boolean,list,tuple,set,dictionary)
my_dict1 = {'name':'mod', 'age':30, 555:999, 'flag':True, 'wow':[10,20,30]}